###################################################################

# Created by write_sdc on Thu Dec  8 19:09:34 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max ss_typical_max_0p81v_125c -max_library           \
sc9_cln40g_base_rvt_ss_typical_max_0p81v_125c\
                         -min ff_typical_min_0p99v_m40c -min_library           \
sc9_cln40g_base_rvt_ff_typical_min_0p99v_m40c
set_wire_load_mode top
set_wire_load_model -name Zero -library                                        \
sc9_cln40g_base_rvt_ss_typical_max_0p81v_125c
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_input_delay -clock clk  0  [get_ports {weight[63]}]
set_input_delay -clock clk  0  [get_ports {weight[62]}]
set_input_delay -clock clk  0  [get_ports {weight[61]}]
set_input_delay -clock clk  0  [get_ports {weight[60]}]
set_input_delay -clock clk  0  [get_ports {weight[59]}]
set_input_delay -clock clk  0  [get_ports {weight[58]}]
set_input_delay -clock clk  0  [get_ports {weight[57]}]
set_input_delay -clock clk  0  [get_ports {weight[56]}]
set_input_delay -clock clk  0  [get_ports {weight[55]}]
set_input_delay -clock clk  0  [get_ports {weight[54]}]
set_input_delay -clock clk  0  [get_ports {weight[53]}]
set_input_delay -clock clk  0  [get_ports {weight[52]}]
set_input_delay -clock clk  0  [get_ports {weight[51]}]
set_input_delay -clock clk  0  [get_ports {weight[50]}]
set_input_delay -clock clk  0  [get_ports {weight[49]}]
set_input_delay -clock clk  0  [get_ports {weight[48]}]
set_input_delay -clock clk  0  [get_ports {weight[47]}]
set_input_delay -clock clk  0  [get_ports {weight[46]}]
set_input_delay -clock clk  0  [get_ports {weight[45]}]
set_input_delay -clock clk  0  [get_ports {weight[44]}]
set_input_delay -clock clk  0  [get_ports {weight[43]}]
set_input_delay -clock clk  0  [get_ports {weight[42]}]
set_input_delay -clock clk  0  [get_ports {weight[41]}]
set_input_delay -clock clk  0  [get_ports {weight[40]}]
set_input_delay -clock clk  0  [get_ports {weight[39]}]
set_input_delay -clock clk  0  [get_ports {weight[38]}]
set_input_delay -clock clk  0  [get_ports {weight[37]}]
set_input_delay -clock clk  0  [get_ports {weight[36]}]
set_input_delay -clock clk  0  [get_ports {weight[35]}]
set_input_delay -clock clk  0  [get_ports {weight[34]}]
set_input_delay -clock clk  0  [get_ports {weight[33]}]
set_input_delay -clock clk  0  [get_ports {weight[32]}]
set_input_delay -clock clk  0  [get_ports {weight[31]}]
set_input_delay -clock clk  0  [get_ports {weight[30]}]
set_input_delay -clock clk  0  [get_ports {weight[29]}]
set_input_delay -clock clk  0  [get_ports {weight[28]}]
set_input_delay -clock clk  0  [get_ports {weight[27]}]
set_input_delay -clock clk  0  [get_ports {weight[26]}]
set_input_delay -clock clk  0  [get_ports {weight[25]}]
set_input_delay -clock clk  0  [get_ports {weight[24]}]
set_input_delay -clock clk  0  [get_ports {weight[23]}]
set_input_delay -clock clk  0  [get_ports {weight[22]}]
set_input_delay -clock clk  0  [get_ports {weight[21]}]
set_input_delay -clock clk  0  [get_ports {weight[20]}]
set_input_delay -clock clk  0  [get_ports {weight[19]}]
set_input_delay -clock clk  0  [get_ports {weight[18]}]
set_input_delay -clock clk  0  [get_ports {weight[17]}]
set_input_delay -clock clk  0  [get_ports {weight[16]}]
set_input_delay -clock clk  0  [get_ports {weight[15]}]
set_input_delay -clock clk  0  [get_ports {weight[14]}]
set_input_delay -clock clk  0  [get_ports {weight[13]}]
set_input_delay -clock clk  0  [get_ports {weight[12]}]
set_input_delay -clock clk  0  [get_ports {weight[11]}]
set_input_delay -clock clk  0  [get_ports {weight[10]}]
set_input_delay -clock clk  0  [get_ports {weight[9]}]
set_input_delay -clock clk  0  [get_ports {weight[8]}]
set_input_delay -clock clk  0  [get_ports {weight[7]}]
set_input_delay -clock clk  0  [get_ports {weight[6]}]
set_input_delay -clock clk  0  [get_ports {weight[5]}]
set_input_delay -clock clk  0  [get_ports {weight[4]}]
set_input_delay -clock clk  0  [get_ports {weight[3]}]
set_input_delay -clock clk  0  [get_ports {weight[2]}]
set_input_delay -clock clk  0  [get_ports {weight[1]}]
set_input_delay -clock clk  0  [get_ports {weight[0]}]
set_input_delay -clock clk  0  [get_ports {padding_data_1[8]}]
set_input_delay -clock clk  0  [get_ports {padding_data_1[7]}]
set_input_delay -clock clk  0  [get_ports {padding_data_1[6]}]
set_input_delay -clock clk  0  [get_ports {padding_data_1[5]}]
set_input_delay -clock clk  0  [get_ports {padding_data_1[4]}]
set_input_delay -clock clk  0  [get_ports {padding_data_1[3]}]
set_input_delay -clock clk  0  [get_ports {padding_data_1[2]}]
set_input_delay -clock clk  0  [get_ports {padding_data_1[1]}]
set_input_delay -clock clk  0  [get_ports {padding_data_1[0]}]
set_input_delay -clock clk  0  [get_ports {padding_data_2[8]}]
set_input_delay -clock clk  0  [get_ports {padding_data_2[7]}]
set_input_delay -clock clk  0  [get_ports {padding_data_2[6]}]
set_input_delay -clock clk  0  [get_ports {padding_data_2[5]}]
set_input_delay -clock clk  0  [get_ports {padding_data_2[4]}]
set_input_delay -clock clk  0  [get_ports {padding_data_2[3]}]
set_input_delay -clock clk  0  [get_ports {padding_data_2[2]}]
set_input_delay -clock clk  0  [get_ports {padding_data_2[1]}]
set_input_delay -clock clk  0  [get_ports {padding_data_2[0]}]
set_input_delay -clock clk  0  [get_ports {padding_data_3[8]}]
set_input_delay -clock clk  0  [get_ports {padding_data_3[7]}]
set_input_delay -clock clk  0  [get_ports {padding_data_3[6]}]
set_input_delay -clock clk  0  [get_ports {padding_data_3[5]}]
set_input_delay -clock clk  0  [get_ports {padding_data_3[4]}]
set_input_delay -clock clk  0  [get_ports {padding_data_3[3]}]
set_input_delay -clock clk  0  [get_ports {padding_data_3[2]}]
set_input_delay -clock clk  0  [get_ports {padding_data_3[1]}]
set_input_delay -clock clk  0  [get_ports {padding_data_3[0]}]
set_input_delay -clock clk  0  [get_ports {padding_data_4[8]}]
set_input_delay -clock clk  0  [get_ports {padding_data_4[7]}]
set_input_delay -clock clk  0  [get_ports {padding_data_4[6]}]
set_input_delay -clock clk  0  [get_ports {padding_data_4[5]}]
set_input_delay -clock clk  0  [get_ports {padding_data_4[4]}]
set_input_delay -clock clk  0  [get_ports {padding_data_4[3]}]
set_input_delay -clock clk  0  [get_ports {padding_data_4[2]}]
set_input_delay -clock clk  0  [get_ports {padding_data_4[1]}]
set_input_delay -clock clk  0  [get_ports {padding_data_4[0]}]
set_input_delay -clock clk  0  [get_ports {bias[15]}]
set_input_delay -clock clk  0  [get_ports {bias[14]}]
set_input_delay -clock clk  0  [get_ports {bias[13]}]
set_input_delay -clock clk  0  [get_ports {bias[12]}]
set_input_delay -clock clk  0  [get_ports {bias[11]}]
set_input_delay -clock clk  0  [get_ports {bias[10]}]
set_input_delay -clock clk  0  [get_ports {bias[9]}]
set_input_delay -clock clk  0  [get_ports {bias[8]}]
set_input_delay -clock clk  0  [get_ports {bias[7]}]
set_input_delay -clock clk  0  [get_ports {bias[6]}]
set_input_delay -clock clk  0  [get_ports {bias[5]}]
set_input_delay -clock clk  0  [get_ports {bias[4]}]
set_input_delay -clock clk  0  [get_ports {bias[3]}]
set_input_delay -clock clk  0  [get_ports {bias[2]}]
set_input_delay -clock clk  0  [get_ports {bias[1]}]
set_input_delay -clock clk  0  [get_ports {bias[0]}]
set_input_delay -clock clk  0  [get_ports rst]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[35]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[34]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[33]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[32]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[31]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[30]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[29]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[28]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[27]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[26]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[25]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[24]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[23]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[22]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[21]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[20]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[19]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[18]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[17]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[16]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[15]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[14]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[13]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[12]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[11]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[10]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[9]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[8]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[7]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[6]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[5]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[4]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[3]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[2]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[1]}]
set_output_delay -clock clk  0  [get_ports {lyr_2_sum[0]}]
set_output_delay -clock clk  0  [get_ports {bmp_lyr1_answer[7]}]
set_output_delay -clock clk  0  [get_ports {bmp_lyr1_answer[6]}]
set_output_delay -clock clk  0  [get_ports {bmp_lyr1_answer[5]}]
set_output_delay -clock clk  0  [get_ports {bmp_lyr1_answer[4]}]
set_output_delay -clock clk  0  [get_ports {bmp_lyr1_answer[3]}]
set_output_delay -clock clk  0  [get_ports {bmp_lyr1_answer[2]}]
set_output_delay -clock clk  0  [get_ports {bmp_lyr1_answer[1]}]
set_output_delay -clock clk  0  [get_ports {bmp_lyr1_answer[0]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[18]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[17]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[16]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[15]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[14]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[13]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[12]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[11]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[10]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[9]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[8]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[7]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[6]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[5]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[4]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[3]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[2]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[1]}]
set_output_delay -clock clk  0  [get_ports {pass_cnt[0]}]
set_output_delay -clock clk  0  [get_ports write_flag]
